unicab369/ch32mess/examples/a_mess_coprocessor/a_useless_button.c
/*
 * Example of a useless code. It doesn't do anything good except being great at what it does.
 * It demonstrates the power of repetition: if you repeat the samething many times over, it becomes you.
 * 
 * fun_gpio.h is based on ch32v_hal.h by Larry Bank
 * fun_timer.h is based on Example SysTick with IRQs work of E. Brombaugh and C. Lohr
 * by unicab369
 */

// .\minichlink.exe -u
// make all monitor

#include "ch32fun.h"
#include <stdio.h>


#include "1_Foundation/fun_button.h"
// #include "3_Nrf/nrf24l01_main.h"

// #define PIN_LOWPOWER 0xD3
#define PIN_LOWPOWER 0xD4
#define PIN_BUTTON 0xD2
// #define PIN_LED 0xA2
#define PIN_LED 0xD0
#define PIN_MODE 0xA1
#define PIN_DONE 0xC3


void nrf_onReceive(uint8_t* data) {
	digitalWrite(PIN_LED, !digitalRead(PIN_LED));
	// struct SensorData* receivedData = (struct SensorData*) data;

	// printf("\n\rRecieved");
	// printf("\n\rtemp=%lu, hum=%lu, lux=%lu, v=%lu, mA=%lu", 
	// 			receivedData->tempF, receivedData->hum, receivedData->lux, receivedData->voltage, receivedData->mA);
}

void make_inputPullups() {
	// Set all GPIOs to input pull up
	RCC->APB2PCENR |= RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD;

	// GPIOA: Set to output
	GPIOA->CFGLR = (GPIO_CNF_IN_PUPD<<(4*2)) | (GPIO_CNF_IN_PUPD<<(4*1));
	GPIOA->BSHR = GPIO_BSHR_BS2 | GPIO_BSHR_BR1;

	GPIOC->CFGLR = (GPIO_CNF_IN_PUPD<<(4*7)) | (GPIO_CNF_IN_PUPD<<(4*6)) |
					(GPIO_CNF_IN_PUPD<<(4*5)) | (GPIO_CNF_IN_PUPD<<(4*4)) |
					(GPIO_CNF_IN_PUPD<<(4*3)) | (GPIO_CNF_IN_PUPD<<(4*2)) |
					(GPIO_CNF_IN_PUPD<<(4*1)) | (GPIO_CNF_IN_PUPD<<(4*0));
	GPIOC->BSHR = GPIO_BSHR_BS7 | GPIO_BSHR_BS6 | GPIO_BSHR_BS5 | GPIO_BSHR_BS4 |
					GPIO_BSHR_BS3 | GPIO_BSHR_BS2 | GPIO_BSHR_BS1 | GPIO_BSHR_BS0;

	GPIOD->CFGLR = (GPIO_CNF_IN_PUPD<<(4*7)) | (GPIO_CNF_IN_PUPD<<(4*6)) |
					(GPIO_CNF_IN_PUPD<<(4*5)) | (GPIO_CNF_IN_PUPD<<(4*4)) |
					(GPIO_CNF_IN_PUPD<<(4*3)) | (GPIO_CNF_IN_PUPD<<(4*2)) |
					(GPIO_CNF_IN_PUPD<<(4*0));
	GPIOD->BSHR = GPIO_BSHR_BS7 | GPIO_BSHR_BS6 | GPIO_BSHR_BS5 | GPIO_BSHR_BS4 |
					GPIO_BSHR_BS3 | GPIO_BSHR_BS2 | GPIO_BSHR_BS0;
	
}

void sleepMode_setup(uint8_t useButton) {
	// enable power interface module clock
	RCC->APB1PCENR |= RCC_APB1Periph_PWR;

	// enable low speed oscillator (LSI)
	RCC->RSTSCKR |= RCC_LSION;
	while ((RCC->RSTSCKR & RCC_LSIRDY) == 0) {}

	// enable AutoWakeUp event
	EXTI->EVENR |= EXTI_Line9;
	EXTI->FTENR |= EXTI_Line9;

	//# t = AWUWR*AWUPSC/fLSI
	// fLSI = 128000
	// AWUWR = 1 to 63
	// AWUPSC = 2048, 4096, 10240 or 61440, though lower values are possible.    

	PWR->AWUPSC |= PWR_AWU_Prescaler_4096;		// configure AWU prescaler
	PWR->AWUWR &= ~0x3f; PWR->AWUWR |= 63;		// configure AWU window comparison value
	PWR->AWUCSR |= (1 << 1);						// enable AWU

	//# standby_btn
	if (useButton) {
		RCC->APB2PCENR |= RCC_AFIOEN;							// AFIO is needed for EXTI
		AFIO->EXTICR |= (uint32_t)(0b11 << (2*2));		// assign pin 2 interrupt from portD (0b11) to EXTI channel 2

		// enable line2 interrupt event
		EXTI->EVENR |= EXTI_Line2;
		EXTI->FTENR |= EXTI_Line2;
	}

	//# sleep
	PWR->CTLR |= PWR_CTLR_PDDS;					// select standby on power-down	
	PFIC->SCTLR |= (1 << 2);						// peripheral interrupt controller send to deep sleep
}


uint32_t ref_counter = 0;
uint8_t delay_arr[4] = { 1, 2, 50, 100 };
uint8_t delay_index = 0;

uint8_t getDelay() {
	return delay_arr[delay_index];
}

uint32_t getRefIncrements() {
	uint32_t delayTime = getDelay();
	return delayTime*18;
}

void setLeds(uint8_t pin1, uint8_t pin2, uint8_t pin3, uint8_t pin4, uint8_t pin5) {
	uint8_t delayTime = getDelay();

	pinMode(pin3, INPUT);
	pinMode(pin4, INPUT);
	pinMode(pin5, INPUT);
	pinMode(pin1, OUTPUT);
	pinMode(pin2, OUTPUT);

	digitalWrite(pin1, 1);
	digitalWrite(pin2, 0);
	Delay_Ms(delayTime);

	digitalWrite(pin1, 0);
	digitalWrite(pin2, 1);
	Delay_Ms(delayTime);
}

void turnOffGPIOs(uint8_t* arr, uint8_t len) {
	for (uint8_t i=0; i<len; i++) {
		pinMode(arr[i], OUTPUT);
		digitalWrite(arr[i], 0);
	}
}



//######### Button
#include "1_Foundation/fun_uart.h"
#include "1_Foundation/i2c_slave.h"
#include "1_Foundation/modPWM.h"
#include "1_Foundation/modEncoder.h"
#include "1_Foundation/modJoystick.h"
#include "Display/modST77xx.h"
#include "2_Device/fun_ws2812.h"
#include "2_Device/ssd1306_draw.h"


volatile uint8_t i2c_registers[32] = {0xaa};

void onWrite(uint8_t reg, uint8_t length) {
	printf("IM HERE.\n\r");
    funDigitalWrite(PA2, i2c_registers[0] & 1);
}

void onRead(uint8_t reg) {
	printf("IM HERE.\n\r");
	digitalWrite(0xC0, !digitalRead(0xD0));
}


// #include "ST7735/st7735_demo.h"
#include "ST7735/modTFT.h"
#include "Storage/modStorage.h"

char str_output[20];

void encoder_onChanged(M_Encoder *model) {
	sprintf(str_output, "Pos %ld delta %ld",
			(int32_t)model->count - model->initial_count, 
			(int32_t)model->count - model->last_count);
	ssd1306_print_str_at(str_output, 0, 0);
	printf(str_output); printf("\n\r");
}

void button_onChanged(int btn, uint32_t duration) {
	if (btn == BTN_SINGLECLICK) {
		sprintf(str_output, "BTN 1x CLICK");
	} else if (btn == BTN_DOUBLECLICK) {
		sprintf(str_output, "BTN 2x CLICK");
	} else if (btn == BTN_LONGPRESS) {
		sprintf(str_output, "BTN LONGPRESS %ld", duration);
	}

	ssd1306_print_str_at(str_output, 0, 0);
	printf(str_output); printf("\n\r");
}

void i2c_scan_callback(const uint8_t addr) {
	if (addr == 0x00 || addr == 0x7F) return; // Skip reserved addresses
	
	static int line = 1;
	sprintf(str_output, "I2C: 0x%02X", addr);
	ssd1306_print_str_at(str_output, line++, 0);
	printf(str_output); printf("\n\r");
}

uint8_t decimal_to_bcd(uint8_t val) { return ((val/10)*16) + (val%10); }

i2c_err_t ret;
uint8_t buff[8];

void test_htu21() {
	uint8_t userRegisterData = 0;

	Delay_Ms(100);
	ret = i2c_write_raw(&dev_htu21, (uint8_t[]){0xFE}, 1);		// Soft reset
	printf("Error0: %d\n", ret);

	ret = i2c_read_reg(&dev_htu21, 0xE7, userRegisterData, 1);		// Read User register
	printf("Error1: %d\n", ret);
	printf("HTU21 User Register: %02X\n", userRegisterData);

