unicab369/ch32mess/examples/a_mess_coprocessor/a_useless_button.c
	userRegisterData &= 0x7E;		// clear resolution bits with 0
	userRegisterData |= 0x80;		// add new resolution bits

	ret = i2c_write_reg(&dev_htu21, 0xE6, userRegisterData, 1);		// Write User register
	printf("Error2: %d\n", ret);

	ret = i2c_read_reg(&dev_htu21, 0xE7, buff, 1);		// Read User register
	printf("Error3: %d\n", ret);
	printf("HTU21 New User Register: %02X\n", userRegisterData);

	ret = i2c_write_raw(&dev_htu21, (uint8_t[]){0xF3}, 1);
	printf("Error4: %d\n", ret);

	Delay_Ms(500);											// Wait for measurement to complete
	ret = i2c_read_raw(&dev_htu21, buff, 2);				// Read Temperature
	// ret = i2c_read_reg(&dev_htu21, 0xF3, buff, 2);		// Read Temperature
	printf("Error5: %d\n", ret);

	printf("HTU21 Read: %02X %02X\n", buff[0], buff[1]);
}

void test_aht21() {
	ret = i2c_read_reg(&dev_aht21, 0x71, buff, 1);
	buff[0] = buff[0] & 0x18;
	printf("Error0: %d\n", ret);
	printf("AHT21 Read reg 0x71: %02X\n", buff[0]);		// expect 0x18

	buff[0] = 0xAC;
	buff[1] = 0X33;
	buff[2] = 0x00;
	ret = i2c_write_raw(&dev_aht21, buff, 3);
	printf("Error1: %d\n", ret);

	ret = i2c_read_raw(&dev_aht21, buff, 6);		// Read sensor
	printf("Error2: %d\n", ret);

	// calculate humidity
	uint32_t hum = (buff[1] << 12) | (buff[2] << 4) | (buff[3] >> 4);
	hum = (hum * 100) / 0x100000;
	printf("Humidity: %lu\n", hum);

	// calculate temperature
	uint32_t temp = ((buff[3] & 0xF) << 16) | (buff[4] << 8) | (buff[5]);
	temp = (temp * 200) / 0x100000;
	printf("Temperature: %lu\n", temp);
}

void test_bmp280() {
	struct {
		int16_t dig_T1;
		int16_t dig_T2;
		int16_t dig_T3;
		// Pressure calibration would be added similarly
	} bmp280_calib;

	ret = i2c_read_reg(&dev_bmp280, 0xD0, buff, 1);
	printf("Error0: %d\n", ret);
	printf("BMP280 Read reg 0xD0: %02X\n", buff[0]);		// expect 0x58

	ret = i2c_read_reg(&dev_bmp280, 0x88, buff, 2);
	bmp280_calib.dig_T1 =  (int16_t)(buff[1] << 8) | buff[0];

	ret = i2c_read_reg(&dev_bmp280, 0x8A, buff, 2);
	bmp280_calib.dig_T2 =  (int16_t)(buff[1] << 8) | buff[0];

	ret = i2c_read_reg(&dev_bmp280, 0x8C, buff, 2);
	bmp280_calib.dig_T3 =  (int16_t)(buff[1] << 8) | buff[0];

	printf("dig_T1: %lu\n", bmp280_calib.dig_T1);
	printf("dig_T2: %lu\n", bmp280_calib.dig_T2);
	printf("dig_T3: %ld\n", bmp280_calib.dig_T3);

	ret = i2c_write_reg(&dev_bmp280, 0xF4, (uint8_t[]){0x5D}, 1);
	printf("Error1: %d\n", ret);
	ret = i2c_read_reg(&dev_bmp280, 0xF7, buff, 6);			// read sensors

	uint32_t raw_pressure = (uint32_t)(buff[0]*4096 + buff[1]*16 + (buff[2]/16));
	uint32_t raw_temp = (uint32_t)(buff[3]*4096 + buff[4]*16 + (buff[5]/16));

	uint32_t var1 = (raw_temp/16384 - bmp280_calib.dig_T1/1024) * bmp280_calib.dig_T2;
	uint32_t var2 = ((raw_temp/131072 - bmp280_calib.dig_T1/8192) * (raw_temp/131072 - bmp280_calib.dig_T1/8192)) * bmp280_calib.dig_T3;
	uint32_t t_fine = var1 + var2;		// t_fine in 0.01 degrees Celsius

	uint32_t temp = t_fine/5120;
	printf("Temperature: %lu\n", temp);

}

void test_hdc1080() {
	ret = i2c_write_reg(&dev_hdc1080, 0x02, (uint8_t[]){0x10}, 1);	// Set configuration register
	printf("Error0: %d\n", ret);

	ret = i2c_write_raw(&dev_hdc1080, (uint8_t[]){0x00}, 1);		// Trigger measurement
	printf("Error1: %d\n", ret);

	Delay_Ms(100);											//! Wait for measurement to complete
	ret = i2c_read_raw(&dev_hdc1080, buff, 4);				// Read data register
	printf("Error2: %d\n", ret);
	printf("HDC1080 Read: %02X %02X %02X %02X\n", buff[0], buff[1], buff[2], buff[3]);

	uint16_t raw_temp = (buff[0] << 8) | buff[1];
	uint16_t raw_hum = (buff[2] << 8) | buff[3];

	uint32_t temp = (raw_temp * 165 / 65536) - 40;
	uint32_t hum = (raw_hum * 100 / 65536);

	printf("Temperature: %lu\n", temp);
	printf("Humidity: %lu\n", hum);
}

void test_si7021() {
	ret = i2c_write_raw(&dev_si7021, (uint8_t[]){0xE3}, 1);
	printf("Error0: %d\n", ret);

	ret = i2c_read_raw(&dev_si7021, buff, 4);				// Read Temperature and Humidity
	printf("Error0: %d\n", ret);

	uint16_t raw_temp = (buff[0] << 8) | buff[1];
	uint32_t temp = ((raw_temp * 17572) >> 16) - 4685;		// >> 16 is equivalent to / 65536
	printf("Temp*100: %lu\n", temp);

	uint16_t raw_hum = (buff[2] << 8) | buff[3];
	uint32_t hum = ((raw_hum * 12500) >> 16) - 600;
	printf("Hum*100: %lu\n", hum);
}

void test_max44009() {
	ret = i2c_read_reg(&dev_max44009, 0x03, buff, 2);		// Read lux registers
	printf("Error0: %d\n", ret);

	int exponent = (buff[0] & 0xF0) >> 4;		// Get exponent from first byte
	int mantissa = ((buff[0] & 0x0F)) << 4 | (buff[1] & 0x0F);	// Get mantissa from both bytes

	uint16_t lux = (1 << exponent) * mantissa * 45;
	printf("Max44009: %02X %02X\n", buff[0], buff[1]);
	printf("lux*1000: %lu\n", lux);
}

void test_adps9960() {
	uint8_t config[] = {
		0x80,           // ENABLE
		0x0F,           // Power ON, Proximity enable, ALS enable, Wait enable
		0x90,           // CONFIG2
		0x01,           // Proximity gain control (4x)
		0x8F, 0x20,     // Proximity pulse count (8 pulses)
		0x8E, 0x87      // Proximity pulse length (16us)
	};
	ret = i2c_write_raw(&dev_apds9960, config, sizeof(config));
	printf("Error0: %d\n", ret);
	// Delay_Ms(50);  // Wait for sensor to initialize

	uint8_t proximity;
	ret = i2c_read_reg(&dev_apds9960, 0x9C, &proximity, 1);		// Read proximity register
	printf("Error1: %d\n", ret);
	printf("APDS9960 Proximity: %d\n", proximity);

	ret = i2c_read_reg(&dev_apds9960, 0x94, buff, 8);			// Read lux registers
	printf("Error2: %d\n", ret);

	uint16_t clear = (buff[1] << 8) | buff[0];
	uint16_t red = (buff[3] << 8) | buff[2];
	uint16_t green = (buff[5] << 8) | buff[4];
	uint16_t blue = (buff[7] << 8) | buff[6];
	printf("clear: %d, red: %d, green: %d, blue: %d\n", clear, red, green, blue);
}

void test_ap3216() {
	ret = i2c_write_raw(&dev_AP3216, (uint8_t[]){0x00, 0x03}, 2);		// Trigger measurement
	printf("Error0: %d\n", ret);

	ret = i2c_read_reg(&dev_AP3216, 0x0C, buff, 4);		// Read data registers
	printf("Error1: %d\n", ret);

	uint16_t lux = (buff[1] << 8) + buff[0];

	uint8_t low_byte = buff[2] & 0b00001111;		// Get low byte of lux
	uint8_t high_byte = buff[3] & 0x00111111;		// Get high byte of lux
	uint16_t proximity = (high_byte << 4) + low_byte;
	printf("lux: %d, proximity: %d\n", lux, proximity);
}

void test_vl53l0x() {
	// ret = i2c_write_raw(&dev_vl35lox, (uint8_t[]){0x00, 0x01}, 2);		// Trigger measurement

	uint8_t status;
	ret = i2c_read_reg(&dev_vl35lox, 0xC0, &status, 1);		// Read system status register
	printf("Error0: %d\n", ret);
	printf("status: %02X\n", status);						// expect 0xEE
	
	// ret = i2c_write_reg(&dev_vl35lox, 0x88, (uint8_t[]){0x00}, 1);		// Start initialization

	// ret = i2c_write_reg(&dev_vl35lox, 0x80, (uint8_t[]){0x01}, 1);
	// ret = i2c_write_reg(&dev_vl35lox, 0xFF, (uint8_t[]){0x01}, 1);
	// ret = i2c_write_reg(&dev_vl35lox, 0x00, (uint8_t[]){0x00}, 1);

	// // ret = i2c_read_reg(&dev_vl35lox, 0x91, buff, 1);		// Read I2C mode register
	// // printf("Error1: %d\n", ret);
	// // printf("VL53L0X Read reg 0x91: %02X\n", buff[0]);		// expect 0x3C
	// ret = i2c_write_reg(&dev_vl35lox, 0x91, (uint8_t[]){0x3C}, 1);		// Set I2C mode

	// ret = i2c_write_reg(&dev_vl35lox, 0x00, (uint8_t[]){0x01}, 1);
	// ret = i2c_write_reg(&dev_vl35lox, 0xFF, (uint8_t[]){0x00}, 1);
	// ret = i2c_write_reg(&dev_vl35lox, 0x80, (uint8_t[]){0x00}, 1);

