unicab369/ch32mess/examples/a_mess_coprocessor/a_useless_button.c
	// start measurement
	ret = i2c_write_reg(&dev_vl35lox, 0x00, (uint8_t[]){0x00}, 1);

	Delay_Ms(100);											// Wait for measurement to complete

	ret = i2c_read_reg(&dev_vl35lox, 0x13, buff, 1);
	printf("Error0: %d\n", ret);
	printf("VL53L0X Read reg 0x13: %02X\n", buff[0]);

	Delay_Ms(100);	
	ret = i2c_read_reg(&dev_vl35lox, 0x14 + 10, buff, 2);				// Read distance register
	printf("Error1: %d\n", ret);

	printf("VL53L0X Read: %02X %02X\n", buff[0], buff[1]);
	uint16_t distance = (buff[1] << 8) + buff[0];
	printf("distance: %d\n", distance);
}

void test_ina219() {
	uint16_t powerLSB = 2;    	// 2uW per bit
	ret = i2c_write_reg(&dev_ina219, 0x00, (uint8_t[]){0x39, 0x9F}, 2);		// Configure INA219 32V 1A Range

	// 2. Set calibration for 1A range (assuming 0.1Ω shunt)
	uint16_t cal = 4096;  // 0.04096 / (0.0001 * 0.1)
	uint8_t cal_bytes[2] = {cal >> 8, cal & 0xFF};
	i2c_write_reg(&dev_ina219, 0x05, cal_bytes, 2);

	ret = i2c_read_reg(&dev_ina219, 0x01, buff, 2);		// Read shunt voltage
	uint16_t shunt_raw = (buff[1] << 8) | buff[0];
	uint16_t shunt = shunt_raw / 100;					// in mV

	ret = i2c_read_reg(&dev_ina219, 0x02, buff, 2);		// Read bus voltage
	uint16_t bus_raw = (buff[1] << 8) | buff[0];
	uint16_t bus = (shunt_raw >> 3) * 4;				// in mV

	ret = i2c_read_reg(&dev_ina219, 0x03, buff, 2);		// Read power
	uint16_t power_raw = (buff[1] << 8) | buff[0];
	uint16_t power = power_raw * powerLSB;				// in uW

	ret = i2c_read_reg(&dev_ina219, 0x04, buff, 2);		// Read current
	uint16_t current_raw = (buff[1] << 8) | buff[0];
	uint16_t current = current_raw;						// in mA

	printf("Shunt Voltage: %d uV\n", shunt);
	printf("Bus Voltage: %d mV\n", bus);
	printf("Power: %d mW\n", power);
	printf("Current: %d mA\n", current);
}

void test_ens160() {
	ret = i2c_read_reg(&dev_ens160, 0x00, buff, 2);		// Read ENS160 ID
	uint16_t ens160_id = (buff[1] << 8) | buff[0];
	printf("ENS160 ID: %04X\n", ens160_id);
	ret = i2c_write_reg(&dev_ens160, 0x10, (uint8_t[]){0x02}, 1);		// set Mode

	// get Air Quality Index (AQI)
	// value: 1 - excelent, 2 - good, 3 - fair, 4 - poor, 5 - very poor
	ret = i2c_read_reg(&dev_ens160, 0x21, buff, 5);		
	printf("ENS160 AQI: %d\n", buff[0]);

	// get Total Volatile Organic Compounds (TVOC)
	// value range: 0 - 65000 ppb	
	uint16_t tvoc = (buff[2] << 8) | buff[1];
	printf("ENS160 TVOC: %d\n", tvoc);

	// get Equivalent CO2 (eCO2)
	// value range: 400 - 65535 ppm
	// level Excelent: 400 - 600 ppm, Good: 600 - 800 ppm, Fair: 800 - 1000 ppm, Poor: 1000 - 1500 ppm, Unhealthy: >1500	
	uint16_t eco2 = (buff[4] << 8) | buff[3];
	printf("ENS160 eCO2: %d\n", eco2);
}

void test_sgp30() {
	ret = i2c_write_raw(&dev_sgp30, (uint8_t[]){0x36, 0x82}, 2);
	printf("Error0: %d\n", ret);					// Initialize SGP30
	ret = i2c_read_raw(&dev_sgp30, buff, 3);		// Read ID
	printf("Error1: %d\n", ret);
	uint16_t id = (buff[0] << 8) | buff[1];		
	printf("SGP30 ID: %04X\n", id);				// expect 0xD400

	ret = i2c_write_raw(&dev_sgp30, (uint8_t[]){0x20, 0x03}, 2);
	printf("Error2: %d\n", ret);		// Initialize SGP30	

	ret = i2c_write_raw(&dev_sgp30, (uint8_t[]){0x20, 0x08}, 2);
	printf("Error0: %d\n", ret);		// Start measurement

	Delay_Ms(100);		// Wait for measurement
	ret = i2c_read_raw(&dev_sgp30, buff, 6);		// Read sensor data
	printf("Error1: %d\n", ret);
	uint16_t co2 = (buff[0] << 8) | buff[1];		// CO2 in ppm
	uint16_t tvoc = (buff[3] << 8) | buff[4];		// TVOC in ppb

	ret = i2c_write_raw(&dev_sgp30, (uint8_t[]){0x20, 0x50}, 2);
	printf("Error2: %d\n", ret);		// Set baseline

	Delay_Ms(100);		// Wait for baseline to be
	ret = i2c_read_raw(&dev_sgp30, buff, 6);		// Read baseline data
	printf("Error3: %d\n", ret);
	uint16_t h2 = (buff[0] << 8) | buff[1];			// H2 baseline
	uint16_t ethanol = (buff[3] << 8) | buff[4];	// Ethanol baseline

	printf("SGP30 CO2: %d ppm, TVOC: %d ppb\n", co2, tvoc);
	printf("SGP30 H2: %d, Ethanol: %d\n", h2, ethanol);
}

int main() {
	static const char message[] = "Hello World!\r\n";
	uint32_t counter = 0;
	uint32_t ledc_time = 0;
	uint32_t sec_time = 0;
	uint32_t time_ref = 0;

	M_Encoder encoder_a = {0, 0, 0};
	M_Button button_a = {0xC0, BUTTON_IDLE, 0, 0, 0, 0, 0, 0};

	SystemInit();
	systick_init();			//! required for millis()
	Delay_Ms(100);
	
	// used PC0
	button_setup(&button_a);

	// TIM2 Ch1, Ch2 : uses PD3, PD4.
	modEncoder_setup(&encoder_a);

	// I2CInit(0xC1, 0xC2, 100000);

	// return 0;

	// I2C1: uses PC1 & PC2
	if(i2c_init(&dev_aht21) != I2C_OK)
		printf("Failed to init I2C\n");
	else
		ssd1306_setup();
		// modI2C_task();

	// sprintf(str_output, "Hello Bee!");
	// ssd1306_print_str_at(str_output, 0, 0);

	// modST7735_setup();
	// pinMode(0xD0, OUTPUT);
	// modJoystick_setup();		// ADC Ch0, Ch1 | DMA1 Ch1
	// ws2812_setup();				// DMA1 Ch3

	// modPWM_setup();				// TIM2 Ch3

	// led_setup();
	// uart_setup();				// PD5
	// dma_uart_setup();			// DMA1 Ch4

    // SPI_init2();

	// Scan the I2C Bus, prints any devices that respond
	printf("----Scanning I2C Bus for Devices---\n");
	i2c_scan(i2c_scan_callback);
	printf("----Done Scanning----\n\n");

	// test_htu21();			//! NOT WORKING
	// test_aht21();
	// test_bmp280();
	// test_hdc1080();
	// test_si7021();
	// test_max44009();
	// test_adps9960();
	// test_ap3216();
	// test_vl53l0x();			//! NOT WORKING
	// test_ina219();
	// test_ens160();
	test_sgp30();

	return 1;


	for(;;) {			
		uint32_t now = millis();

		button_run(&button_a, button_onChanged);
		modEncoder_task(now, &encoder_a, encoder_onChanged);

		if (now - sec_time > 2000) {
			sec_time = now;

			sprintf(str_output, "counter %lu", counter++);
			ssd1306_print_str_at(str_output, 7, 0);

			// check_sensors();


			if (i2c_ping(dev_htu21.addr) == I2C_OK) {
				printf("HTU21\n");
				buff[0] = 0xE3;
				ret = i2c_read_reg(&dev_htu21, 0xE3, buff, 3);
				// err = i2c_write_raw(&dev_htu21, buff, 1);
				printf(("Error0: %d\n"), ret);

				// Delay_Ms(50);
				// err = i2c_read_raw(&dev_htu21, buff, 3);
				// printf(("Error1: %d\n"), err);

				printf("HTU21 Read: %02X %02X %02X\n", buff[0], buff[1], buff[2]);
			}

			// AHT21 Addr: 0x38
			if (i2c_ping(dev_aht21.addr) == I2C_OK) {
				buff[0] = 0xAC;
				buff[1] = 0X33;
				buff[2] = 0x00;
				// I2CWrite(dev_aht21.addr, buff, 3);
				ret = i2c_write_raw(&dev_aht21, buff, 3);
				printf(("Error1: %d\n"), ret);

				Delay_Ms(100);
				I2CRead(dev_aht21.addr, buff, 6);
				ret = i2c_read_raw(&dev_aht21, buff, 6);
				printf(("Error2: %d\n"), ret);

				//CALCULATING HUMIDITY
				uint32_t humidity;
				humidity = (buff[1] << 12) | (buff[2] << 4) | (buff[3] >> 4);
				humidity = (humidity * 100);
				humidity = humidity / 0x100000;
				printf("Humidity: %lu\n\n", humidity);
			}

