unicab369/ch32mess/examples/a_mess_coprocessor/a_useless_button.c
			// SHT3x Addr: 0x44
			if (i2c_ping(dev_sht3x.addr) == I2C_OK) {
				uint16_t tempF, hum;
				
				Delay_Ms(1);
				SHT3x_getReading(&tempF, &hum);
				sprintf(str_output, "temp %lu, hum %lu", tempF, hum);
				// ssd1306_print_str_at(str_output, 2, 0);
				// printf(str_output); printf("\n\r");

				Delay_Ms(100);
			}

			// BH1750 Addr: 0x23
			if (i2c_ping(dev_bh17.addr) == I2C_OK) {
				uint8_t readData[2];

				// I2CWrite(BH17_ADDR, BH17_CONT_HI1, 1);
				// Delay_Ms(200); // Wait for measurement to complete
				// I2CRead(BH17_ADDR, readData, 2);
				// printf("BH17 Read: %02X %02X\n", readData[0], readData[1]);
				
				// uint16_t lux = BH17_Read(); 
				// sprintf(str_output, "lux %lu", lux);
				// ssd1306_print_str_at(str_output, 1, 0);
				// printf(str_output); printf("\n\r");
			}

			// DS3231 Addr: 0x68
			if (i2c_ping(dev_ds3231.addr) == I2C_OK) {
				uint8_t time[3] = {0};  // Time in Sec, Min, Hrs (Hex not Decimal)

				// Read time from DS3231
				i2c_read_reg(&dev_ds3231, 0x00, time, sizeof(time));
				sprintf(str_output, "Time %02X:%02X:%02X", time[2], time[1], time[0]);
				ssd1306_print_str_at(str_output, 3, 0);
				printf(str_output); printf("\n\r");
			}

			// APDS9960 Addr: 0x39
			if (i2c_ping(dev_apds9960.addr) == I2C_OK) {
				uint8_t proximity = 0;
				i2c_read_reg(&dev_apds9960, 0x9C, &proximity, 1);
				sprintf(str_output, "Prox %02X", proximity);
				ssd1306_print_str_at(str_output, 5, 0);
				printf(str_output); printf("\n\r");

				uint8_t raw[8] = { 0 };
				i2c_read_reg(&dev_apds9960, 0x94, raw, sizeof(raw));
				uint16_t red = (raw[1] << 8) | raw[0];
				uint16_t green = (raw[3] << 8) | raw[2	];
				uint16_t blue = (raw[5] << 8) | raw[4];
				uint16_t clear = (raw[7] << 8) | raw[6];				
				sprintf(str_output, "Red %lu, Green %lu, Blue %lu, Clear %lu", red, green, blue, clear);
				ssd1306_print_str_at(str_output, 6, 0);
				printf(str_output); printf("\n\r");
			}

			// modJoystick_task();
			// dma_uart_tx(message, sizeof(message) - 1);

			// uint32_t runtime_i2c = get_runTime(modI2C_task);
			// sprintf(str_output, "I2C runtime: %lu us", runtime_i2c);
			// ssd1306_print_str_at(str_output, 0, 0);

			// print_runtime("ST7735", st7735_task);
			// print_runtime("ST7735b", tft_test);

			// storage_test();
		}

	// 	if (now - ledc_time > 12) {
	// 		ledc_time = now;
	// 		modPWM_task();
	// 		ws2812_task();
	// 	}
	}
}

//######### MAIN
uint8_t turnOff = 0;

int main2() {  
	SystemInit();
	pinMode(0xD2, OUTPUT);
	digitalWrite(0xD2, 1);
	pinMode(0xC0, INPUT);

	for(;;) {
		uint8_t read = digitalRead(0xC0);

		if (read) {
			uint32_t refIncrements = getRefIncrements();
			ref_counter+=refIncrements;

			if (ref_counter > 4000) {
				turnOff = 1;
			} else if (ref_counter > 1000) {
				delay_index++;
				if (delay_index>=sizeof(delay_arr)) delay_index = 0;
				ref_counter = 0;
			}
		} else {
			ref_counter = 0;
		}

		if (turnOff == 1) {
			uint8_t gpios[5] = { 0xD6, 0xC3, 0xD0, 0xD3, 0xC2 };
			turnOffGPIOs(gpios, sizeof(gpios));
			digitalWrite(0xD2, 0);
		} else {
			setLeds(0xD6, 0xC3, 0xD0, 0xD3, 0xC2);
			setLeds(0xD6, 0xD0, 0xC3, 0xD3, 0xC2);
			setLeds(0xD6, 0xD3, 0xC3, 0xD0, 0xC2);
			setLeds(0xD6, 0xC2, 0xC3, 0xD0, 0xD3);

			setLeds(0xC3, 0xD0, 0xD6, 0xD3, 0xC2);
			setLeds(0xC3, 0xD3, 0xD6, 0xD0, 0xC2);
			setLeds(0xC3, 0xC2, 0xD0, 0xD6, 0xD3);

			setLeds(0xD0, 0xD3, 0xC3, 0xD6, 0xC2);
			setLeds(0xD0, 0xC2, 0xC3, 0xD6, 0xD3);
		}
	}

	// // pinMode(PIN_LED, OUTPUT);
	// // pinMode(PIN_LOWPOWER, INPUT_PULLUP);
	// // pinMode(PIN_MODE, INPUT_PULLUP);
	// // pinMode(0xC3, OUTPUT);
	// // pinMode(PIN_DONE, OUTPUT);

	// // I2CInit(0xC1, 0xC2, 100000);
	// // BH17_Setup();

	// // button_setup(PIN_BUTTON);

	// // lowPower flag INPUT_PULLUP, Low for OFF
	// uint8_t readLowpower = digitalRead(PIN_LOWPOWER);
	// struct SensorData readings = { 0, 0, 0, 0, 0 };

	// // readLowpower == 1
	// if (readLowpower == 0) {
	// 	printf("\n\rIM HERE 1111");
	// 	nrf_setup(0);

	// 	for(;;) {
	// 		i2c_getReadings(&readings);
	// 		printf("\n\rtemp=%lu, hum=%lu, lux=%lu, v=%lu, mA=%lu", 
	// 					readings.tempF, readings.hum, readings.lux, readings.voltage, readings.mA);
	// 		sendData(&readings, sizeof(readings));
	// 		digitalWrite(PIN_LED, !digitalRead(PIN_LED));
	// 		digitalWrite(PIN_DONE, 1);
	// 		Delay_Ms(2000);
	// 	}
	// } else {
	// 	printf("\n\rIM HERE 2222");
	// 	nrf_setup(1);

	// 	// GPIO D0 Push-Pull for RX notification
	// 	RCC->APB2PCENR |= RCC_APB2Periph_GPIOD;
	// 	GPIOD->CFGLR &= ~(0xf<<(4*4));
	// 	GPIOD->CFGLR |= (GPIO_Speed_10MHz | GPIO_CNF_OUT_PP)<<(4*4);

	// 	for(;;) {
	// 		nrf_run(1);
	// 	}
	// }

	// if (readLowpower == 1) {
	// 	Delay_Ms(3500);
	// 	make_inputPullups();
	// 	sleepMode_setup(1);

	// 	for(;;) {
	// 		__WFE();
	// 		SystemInit();

	// 		digitalWrite(0xC3, 0);
	// 		nrf_setup(0);
	// 		send();
	// 		send();
	// 		digitalWrite(0xC3, 1);
	// 		digitalWrite(PIN_DONE, 1);
	// 		// Delay_Ms(1000);
	// 		// // make_inputPullups();
	// 		// // pinMode(0xC3, INPUT_PULLDOWN);
	// 	}
	// } 
	// else {
	// 	uint8_t readMode = digitalRead(PIN_MODE);
	// 	printf("\nMOde=%u", readMode);
	// 	nrf_setup(readMode);

	// 	// GPIO D0 Push-Pull for RX notification
	// 	RCC->APB2PCENR |= RCC_APB2Periph_GPIOD;
	// 	GPIOD->CFGLR &= ~(0xf<<(4*4));
	// 	GPIOD->CFGLR |= (GPIO_Speed_10MHz | GPIO_CNF_OUT_PP)<<(4*4);

	// 	for(;;) {
	// 		nrf_run(readMode);
	// 		button_run();
	// 	}
	// }
}

